{"title":"The Real You","date":"2018-11-26T00:00:00.000Z","date_formatted":{"ll":"Nov 26, 2018","L":"11/26/2018","MM-DD":"11-26"},"thumbnail":"https://blog-1251959181.cos.accelerate.myqcloud.com/Alan_Watts.jpg","link":"2018/11/25/share_Alan","comments":true,"tags":["Music","Speech"],"categories":["Sharing"],"updated":"2024-07-01T17:57:02.538Z","content":"<blockquote>\n<p>网易云音乐单曲：<a href=\"https://music.163.com/#/song?id=399953150\" target=\"_blank\">Into the Light</a> – Jay Hifive<br>\n<a href=\"https://www.bilibili.com/video/av52563485\" target=\"_blank\">B站视频链接</a><br>\n<a href=\"https://youtube.com/watch?v=mMRrCYPxD0I\" target=\"_blank\">油管视频链接</a></p>\n</blockquote>\n<iframe src=\"//player.bilibili.com/player.html?aid=52563485&cid=91989200&page=1\" scrolling=\"no\" border=\"0\" frameborder=\"no\" framespacing=\"0\" allowfullscreen=\"true\"> </iframe>\n<p>If you’re ready to wake up, you’re going to wake up and if you’re not ready, you’re going to stay pretending that you’re just “poor little me”.</p>\n<p>And since you’re all here and engaged in this sort of inquiry and listening to this sort of lecture, I<br>\nassume that you’re all on the process of waking up or else you’re teasing yourself with some kind of flirtation with waking up which you’re not serious about.</p>\n<p>But I assume maybe you are not serious, but sincere that you are ready to wake up. So then, when you’re in the way of waking up and finding out who you really are, what you do is what the whole universe is doing at the place you call here and now.</p>\n<p>You are something the whole universe is doing in the same way that a wave is something that the whole ocean is doing.</p>\n<p>The real you is not a puppet which life pushes around.</p>\n<p>The real, deep down you is the whole universe.</p>\n<p>So then, when you die, you’re not going to have to put up with everlasting non-existing. Because that’s not an experience. A lot of people are afraid that when they die they’re going to be locked up in a dark room forever and sort of undergo that. But one of the most interesting things in the world – this is yoga, this is a way of realization.</p>\n<p>Try and imagine what it will be like to go to sleep and never wake up.</p>\n<p>Think about that.</p>\n<p>Children think about that.</p>\n<p>It’s one of the great wonders of life.</p>\n<p>What will it be like to go to sleep and never wake up?</p>\n<p>And if you think long enough about that, something will happen. You will find out, among other things. That it will pose the next question to you. What was it like to wake up after having never gone to sleep?</p>\n<p>That was when you were born.</p>\n<p>You see? You cant have an experience of nothing; Nature abhors a vacuum. So after you’re dead, the only thing that can happen is the same experience, or the same sort of experience of before you were born. In other words, we all know very well that after people die. Other people are born.<br>\nAnd they’re all you, only you can only experience one at a time.</p>\n<p>Everybody is I, you all you’re you.</p>\n<p>And wheresoever’s beings exist throughout all galaxies it doesn’t make a difference.</p>\n<p>You are all of them and when they come into being as you come into being.</p>\n<p>You know that very well.</p>\n<p>Only you don’t have to remember the past in the same way you don’t have to think about you work thyroid gland or whatever else it is in your organism. You don’t have to know how to shine the sun., You just do it. Like you breathe. Doesn’t it really astonish you that you are the fantastically complex thing and that you’re doing all of this and you never had any education on how to do it.</p>\n<p>If you ready to wake up, you gonna wake up</p>\n<p>and if you’re not ready you’re gonna stay pretending that you’re just a ‘poor little me’.</p>\n<p>And since you all here and engaged in this sort of inquiry and listening to this sort of lecture,</p>\n<p>I assume that you’re all on the process of waking up.</p>\n<p>Or else you’re teasing yourselves with some kind of flirtation with waking up</p>\n<p>which you’re not serious about.</p>\n<p>But I assume maybe you are not serious, but sincere</p>\n<p>that you are ready to wake up.</p>\n<p>So then, when you’re in the way of waking up, and finding out who you really are,</p>\n<p>what you do is what the whole universe is doing at the place you call here and now.</p>\n<p>You are something the whole universe is doing in the same way that a wave is something that the whole ocean is doing.</p>\n<p>The real you is not a puppet which life pushes around;</p>\n<p>the real, deep down you is the whole universe.</p>\n<p>So then, when you die,</p>\n<p>you’re not going to have to put up with everlasting non-existence,</p>\n<p>because that’s not an experience.</p>\n<p>Lot of people are afraid that when they die,</p>\n<p>they’re gonna be locked up in a dark room forever,</p>\n<p>and sort of undergo that.</p>\n<p>But one of the most interesting things in the world - this is a yoga, this is a way of realization</p>\n<p>try and imagine what it will be like to go to sleep and never wake up.</p>\n<p>Think about that.</p>\n<p>Children think about that.</p>\n<p>It’s one of the great wonders of life.</p>\n<p>What will it be like to go to sleep and never wake up?</p>\n<p>And if you think long enough about that, something will happen to you.</p>\n<p>You will find out, among other things,</p>\n<p>that it will pose the next question to you.</p>\n<p>What was it like to wake up after having never gone to sleep?</p>\n<p>That was when you were born.</p>\n<p>You see, you can’t have an experience of nothing;</p>\n<p>nature abhors a vacuum.</p>\n<p>So after you’re dead, the only thing that can happen is the same experience, or the same sort of experience when you were born.</p>\n<p>In other words, we all know very well that after people die, other people are born.</p>\n<p>And they’re all you, only you can only experience one at a time.</p>\n<p>Everybody is I, you all know you’re you</p>\n<p>and wheresoever beings exist throughout all galaxies, it doesn’t make any difference.</p>\n<p>You are all of them.</p>\n<p>And when they come into being, that’s you coming into being.</p>\n<p>You know that very well,</p>\n<p>only you don’t have to remember the past in the same way you don’t have to think about how you work your thyroid gland,</p>\n<p>or whatever else it is in your organism.</p>\n<p>You don’t have to know how to shine the sun. You just do it, like you breath.</p>\n<p>Doesn’t it really astonish you that you are the fantastically complex thing,</p>\n<p>and that you’re doing all of this and you never had any education in how to do it?</p>\n","prev":{"title":"Wear Sunscreen","link":"2019/01/02/share_Wear_Sunscreen"},"next":{"title":"HTML基础","link":"2018/07/27/imooc_164_1"},"plink":"https://vincenteliang.com/2018/11/25/share_Alan/","reward":true,"copyright":{"author":"Vincente Liang","link":"<a href=\"https://vincenteliang.com/2018/11/25/share_Alan/\" title=\"The Real You\">https://vincenteliang.com/2018/11/25/share_Alan/</a>","license":"Attribution-NonCommercial-NoDerivatives 4.0 International (<a href=\\\"https://creativecommons.org/licenses/by-nc-sa/4.0/\\\" rel=\\\"external nofollow\\\" target=\\\"_blank\\\">CC BY-NC-ND 4.0</a>)","published":"November 26, 2018","updated":"July 1, 2024"},"reading_time":"1094 words in 7 min"}